read_verilog src/project.v

read_liberty sky130_fd_sc_hd__tt_025C_1v80.lib

synth -top tt_um_BNN
dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib

write_verilog netlist.v
